<?php
// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Strings for local_learning_analytics
 *
 * @package     local_learning_analytics
 * @copyright   Lehr- und Forschungsgebiet Ingenieurhydrologie - RWTH Aachen University
 * @license     http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

$string['pluginname'] = 'آنالیز  یادگیری';

$string['privacy:metadata'] = 'این افزونه هیچ داده شخصی‌ای را ذخیره نمی‌کند.';

$string['learning_analytics'] = 'آنالیز  یادگیری';
$string['navigationlink'] = 'آنالیز یادگیری';

$string['subplugintype_lareport'] = 'گزارش آ.ی.';
$string['subplugintype_lareport_plural'] = 'گزارش‌های آ.ی.';
$string['subplugintype_lalog'] = 'لاگ آ.ی.';
$string['subplugintype_lalog_plural'] = 'لاگ‌های آ.ی.';

$string['show_full_list'] = 'گسترش لیست';

// عبارت‌هایی که توسط زیرافزونه‌ها نیز استفاده می‌شوند
$string['learners'] = 'آموزش‌یافتگان';
$string['sessions'] = 'جلسات';
$string['hits'] = 'بازدیدها';

// Settings
$string['general_settings'] = 'تنظیمات عمومی';
$string['setting_status_description'] = 'این مقدار تعیین می‌کند که آیا رابط کاربری باید فعال شود و آیا لینک‌ها باید در ناوبری نمایش داده شوند یا خیر. به طور پیش‌فرض، لینک و صفحه قابل مشاهده هستند اگر ورود به سیستم برای دوره‌ای فعال شده باشد. شما می‌توانید از این گزینه استفاده کنید، اگر می‌خواهید ورود به سیستم در تمام دوره‌ها را فعال کنید، اما فقط می‌خواهید رابط کاربری را در دوره‌های خاصی فعال کنید.';
$string['setting_status_option_show_if_enabled'] = 'نمایش لینک ناوبری اگر ورود به سیستم برای دوره فعال شده باشد';
$string['setting_status_option_show_courseids'] = 'نمایش لینک ناوبری اگر دوره از طریق شناسه‌های دوره مشخص شود';
$string['setting_status_option_show_always'] = 'نمایش لینک ناوبری برای تمامی دوره‌ها، حتی اگر ورود به سیستم برای دوره غیرفعال باشد (فقط اگر قبلاً داده‌ها ثبت شده باشند، این گزینه را فعال کنید)';
$string['setting_status_option_hidelink'] = 'عدم نمایش لینک ناوبری اما حفظ صفحه برای تمامی دوره‌ها (تنها اگر لینک را می‌شناسید و به صفحه دسترسی دارید، این گزینه را فعال کنید)';
$string['setting_status_option_disable'] = 'عدم نمایش لینک ناوبری و غیرفعال کردن صفحه برای تمامی دوره‌ها';
$string['setting_status_course_customfield'] = 'اضافه کردن گزینه به تنظیمات دوره تا معلمان بتوانند آن را بر روی دوره‌های خود فعال کنند';

$string['setting_course_ids_description'] = 'وقتی از گزینه دوم بالا استفاده می‌کنید، از این گزینه استفاده کنید تا تصمیم بگیرید کدام دوره‌ها رابط کاربری را فعال کنند.';
$string['dataprivacy_threshold_description'] = 'این مقدار تعیین می‌کند چند "نقطه داده" باید در یک مجموعه داده وجود داشته باشد تا داده نمایش داده شود.';
$string['navigation_position_beforekey_description'] = 'امکان تعیین محل اضافه کردن لینک به صفحه در ناوبری دوره وجود دارد. به طور پیش‌فرض، لینک قبل از اولین گره "بخش" اضافه می‌شود. مقدار مثال: <code>grades</code> برای نمایش قبل از لینک نمرات. می‌توانید کلید یک گره در ناوبری را با استفاده از ابزارهای توسعه‌دهنده پیدا کنید. روی یک لینک در ناوبری کلیک راست کنید، <em>بررسی</em> را انتخاب کنید و ویژگی <code>data-key</code> عنصر <code>a</code> مرتبط را بررسی کنید.';
$string['setting_student_rolenames_description'] = 'در صورتی که نقش‌های دانشجویان/کاربران در یک دوره <code>student</code> نباشد، می‌توانید نام نقش مرتبط را مشخص کنید. در صورت وجود چندین نقش برای دانشجویان، از یک کاما استفاده کنید. مثال: <code>student,customrole</code>';
$string['setting_student_enrols_groupby_description'] = 'این گزینه تعیین می‌کند کدام دوره‌ها در صفحه "دوره‌های قبلی/موازی" با هم ترکیب می‌شوند و کدام مقدار برای نمایش نام‌ها استفاده می‌شود.';
$string['setting_dashboard_boxes'] = 'تعیین می‌کند کدام جعبه‌ها در داشبورد نمایش داده می‌شوند، به چه ترتیب و چقدر بزرگ هستند. مشخصات به فرمت <code>reportname:width</code> هستند که توسط کاما جدا شده‌اند. هر خط حداکثر عرض 12 دارد و پس از آن شکسته می‌شود. مثال: <code>learners:8,activities:4</code> دو جعبه در داشبورد نمایش می‌دهد که اولی از دومی بسیار عریضتر است. در بیشتر موارد، مقدار فقط در صورت نصب زیرافزونه‌های دیگر نیاز به تغییر دارد.';

// راهنما
$string['help_title'] = 'راهنما';
$string['help_take_tour'] = 'تور تعاملی را شروع کنید';
$string['help_text'] = 'صفحه "آمار استفاده" سرویس آنالیتیکس یادگیری، شاخص‌های کلیدی دوره شما را نمایش می‌دهد.

آمار نمایش داده شده زنده است و داده‌هایی را که توسط سرویس جمع‌آوری شده و همچنین داده‌های دوره مودل نمایش می‌دهد. تمام داده‌های جمع‌آوری شده توسط سرویس آنالیتیکس یادگیری به صورت کاملاً ناشناس جمع‌آوری می‌شوند و نمی‌توان به کاربران ردیابی شد.';

$string['help_faq'] = 'سوالات متداول (FAQ)';

$string['help_faq_personal_data_question'] = 'چرا آمار شخصی‌سازی شده، مانند تعداد کلیک‌ها به ازای هر کاربر، نمایش داده نمی‌شود؟';
$string['help_faq_personal_data_answer'] = 'به دلایل حفظ حریم خصوصی داده‌ها، سرویس آنالیتیکس یادگیری اطلاعات شخصی را جمع‌آوری نمی‌کند. بنابراین، بیشتر آمارهای نمایش داده شده (مانند فعالیت‌های پراستفاده شده) فقط شامل اطلاعاتی درباره چقدر یک منبع منابع دسترسی‌پذیری شده است، اما نه تعداد شرکت‌کنندگان.
استثنا از این قاعده آمارهای مربوط به شرکت‌کنندگان و آزمون‌ها/تکالیف هستند، که همچنین داده‌های داخلی مودل را نیز نمایش می‌دهند.';

$string['help_faq_week_start_question'] = 'چرا هفته اول در نمودار داشبورد با شروع واقعی درس مطابقت ندارد؟';
$string['help_faq_week_start_answer'] = 'نمایش در داشبورد به تنظیم "تاریخ شروع دوره" در تنظیمات دوره وابسته است. اگر تاریخ مشخص‌شده در آن با شروع واقعی درس مطابقت نداشته باشد، نمایش در داشبورد هم درست نخواهد بود.
مدیر این دوره می‌تواند تنظیمات را در تنظیمات دوره (در عمومی / تاریخ شروع دوره) تصحیح کند.';

$string['help_faq_data_storage_question'] = 'چه داده‌هایی توسط سرویس ذخیره و نمایش داده می‌شوند؟';
$string['help_faq_data_storage_answer'] = 'داده‌های ارائه شده از دو منبع داده تشکیل شده‌اند.
هر دو منبع داده در پایگاه داده داخلی مودل ذخیره می‌شوند.
اولین منبع داده پایگاه داده داخلی مودل می‌باشد، مانند تعداد دانشجویان در دوره (جعبه چپ در داشبورد).
بعضی از این مجموعه‌های داده در صفحات دیگر مودل مشاهده می‌شوند و در این صفحات به طرز متفاوتی نمایش داده می‌شوند.
دومین منبع داده داده‌هایی است که به‌صورت ویژه برای نمایش در صفحه آمار استفاده جمع‌آوری می‌شوند.
تمام داده‌های جمع‌آوری شده به این منظور به‌صورت ناشناس ذخیره می‌شوند و نمی‌توان به کاربران خاصی رجوع کرد.
به‌طور خاص، داده‌های زیر با هر درخواست در مودل ذخیره می‌شوند:';
$string['help_faq_data_storage_answer_list'] = 'نوع عملیات (مثلاً "مشاهده منبع")
زمان (دقیق تا ثانیه)
دوره مرتبط که عملیات در آن رخ داده است
زمینه مرتبط (مانند منبعی که مشاهده شده است)
سیستم عامل و مرورگر (مانند "ویندوز 10" و "فایرفاکس")، نسخه‌های دقیق مرورگر یا سیستم عامل ذخیره نمی‌شوند';

$string['help_faq_privacy_threshold_question'] = 'چرا برخی از مقادیر به عنوان "< {$a}" نمایش داده می‌شوند؟';
$string['help_faq_privacy_threshold_answer'] = 'به دلایل حفظ حریم خصوصی داده‌ها، داده‌های تجمعی فقط در صورتی نمایش داده می‌شوند که حداقل {$a} نقطه داده وجود داشته باشد.';

$string['help_faq_visibility_question'] = 'چه کسانی به آمار استفاده دسترسی دارند؟';
$string['help_faq_visibility_answer'] = 'برای تضمین حداکثر شفافیت، داده‌های نمایش داده شده توسط مالکان دوره و همچنین توسط شرکت‌کنندگان دوره مشاهده می‌شوند.';

$string['help_faq_datapoints_question'] = 'چرا تعداد بازدیدها برای انواع مختلف مواد به شدت متفاوت است؟';
$string['help_faq_datapoints_answer'] = 'ارقام نمایش داده شده تعداد بازدیدها/دسترسی‌ها را نشان می‌دهند. این تعداد بسته به نوع مواد می‌تواند بسیار متغیر باشد.
برای مثال، وقتی یک PDF دانلود می‌شود، تنها یک بازدید ثبت می‌شود.
اما در مورد یک آزمون که سوالات آن بر روی چند صفحه توزیع شده‌اند، همچنین در طی یک اجرای تست تعدادی بازدید در دوره وجود دارد.';

$string['help_faq_developer_question'] = 'چه کسانی سرویس را توسعه می‌دهند و از کجا می‌توانم اطلاعات بیشتری بدست آورم؟';
$string['help_faq_developer_answer'] = 'سرویس آنالیتیکس یادگیری توسط مرکز خدمات آموزش و یادگیری در دانشگاه RWTH آخن توسعه داده می‌شود.
این توسعه به صورت متن باز (Open Source) انجام شده است. به همین دلیل می‌توانید الگوریتم‌های استفاده‌شده را خود بررسی کنید. در صفحات زیر می‌توانید به اطلاعات بیشتری دسترسی پیدا کنید:';

// تور
$string['tour_title'] = 'آنالیتیکس یادگیری';
$string['tour_dashboard_graph'] = 'نمودار تعداد تمام عملیات‌ها در هر هفته را نشان می‌دهد.

اگر دوره در حال اجرا باشد، شروع هفته جاری توسط یک خط نقطه‌دار نشان داده می‌شود. اعداد هفته جاری نمایش داده نمی‌شوند.';
$string['tour_dashboard_boxes'] = 'در بخش پایین، اعداد کلیدی مهم دوره نمایش داده می‌شوند.

همچنین هر جعبه شامل یک لینک است که از طریق آن اطلاعات بیشتری در دسترس است.';
$string['tour_box_learners'] = 'نشانگر اول تعداد کلیه شرکت‌کنندگان را نمایش می‌دهد. زیر عدد بزرگ، تغییرات نسبت به هفته گذشته نمایش داده می‌شوند.';
$string['tour_box_learnerslink'] = 'روی لینک کلیک کنید تا اطلاعات بیشتری درباره شرکت‌کنندگان مشاهده کنید.';
$string['tour_box_hits'] = 'این نشانگر تعداد عملیات‌ها در طی 7 روز گذشته را نشان می‌دهد. در زیر، تغییرات در طی 7 روز قبل نمایش داده شده‌اند.

با کلیک بر روی لینک می‌توانید یک نقشه حرارت باز کنید که تعداد عملیات‌ها در طول تمام ترم تحصیلی را نمایش می‌دهد.';
$string['tour_box_quiz_assign'] = 'این نشانگر تعداد تلاش‌های آزمون و ارسال‌های تکالیف در طی 7 روز گذشته را نمایش می‌دهد. در زیر، تغییرات در طی 7 روز قبل نیز نمایش داده می‌شوند.

با کلیک بر روی لینک می‌توانید جزئیات درباره آزمون‌ها و تکالیف دوره را مشاهده کنید.';
$string['tour_activities'] = 'آخرین نمایش سه فعالیت پراستفاده از طی 7 روز گذشته را نشان می‌دهد.

با کلیک بر روی لینک می‌توانید جزئیات فعالیت‌های دوره را مشاهده کنید.';

$string['tour_more_information'] = 'تور تعاملی اکنون تکمیل شده است. امیدواریم توانسته‌ایم به شما دیدی خوب از ویژگی‌ها ارائه دهیم.

پاسخ‌های بیشتری به سوالات متداول را می‌توانید در صفحه راهنما پیدا کنید.';

$string['learning_analytics:view_statistics'] = 'دسترسی به آمارهای استفاده در دوره‌ها';
// فیلد سفارشی
$string['customfield_category_name'] = 'آنالیتیکس یادگیری';
$string['customfield_category_description'] = 'این دسته بندی به طور خودکار توسط افزونه آنالیتیکس یادگیری (local_learning_analytics) ایجاد شده است. شما نباید به صورت دستی آن را حذف کنید.';
$string['customfield_field_name'] = 'فعال‌سازی آمارهای استفاده';
$string['customfield_field_description'] = 'با فعال‌سازی، لینک "آمارهای استفاده" به ناوبری دوره‌ی شما اضافه می‌شود.';
// اطلاعات مدیریتی فیلد سفارشی
$string['admin_customfield_info'] = 'شما می‌توانید نام گزینه را در تنظیمات دوره خود تغییر دهید، با تغییر نام در صفحات زیر:';
$string['admin_customfield_category'] = 'دسته بندی را تغییر دهید';
$string['admin_customfield_category_hint'] = 'روی آیکون مداد کنار دسته بندی کلیک کنید تا نام تغییر یابد';
$string['admin_customfield_option'] = 'گزینه را تغییر دهید';
$string['admin_customfield_option_hint'] = 'شما تنها می‌توانید متن نام و توضیح را تغییر دهید';
$string['admin_customfield_no_manual_delete'] = 'دسته بندی یا گزینه را حذف نکنید. شما تنها می‌توانید نام آن‌ها را تغییر دهید. اگر می‌خواهید گزینه را حذف کنید، به جای آن وضعیت بالا را تغییر دهید.';
