<?php
// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Language file.
 *
 * @package    block_xp
 * @copyright  2014 Frédéric Massart
 * @license    http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 * @codingStandardsIgnoreFile
 */

$string['actions'] = 'اقدامات';
$string['activityoresourceis'] = 'فعالیت یا منبع {$a} است';
$string['addacondition'] = 'افزودن شرط';
$string['addarule'] = 'افزودن قانون';
$string['addonnotactivated'] = 'افزونه فعال نشده است.';
$string['adminscanearnxp'] = 'Admins can earn points';
$string['adminscanearnxp_desc'] = 'By default, administrators are not included in the group of users who can earn points. This is because administrators always have the permission _block/xp:earnxp_, allowing them to continuously collect points everywhere. You can use this setting to let administrators also earn points.';
$string['admindefaultrulesintro'] = 'قوانین زیر به عنوان پیش‌فرض برای دوره‌هایی که این بلوک به آنها اضافه می‌شود، استفاده خواهند شد.';
$string['admindefaultsettingsintro'] = 'تنظیمات زیر به عنوان تنظیمات پیش‌فرض استفاده خواهند شد وقتی که بلوک به یک دوره جدید اضافه می‌شود. برخی از تنظیمات قفل شده‌اند، به طوری که مقدار آنها در تمام نمونه‌های پلاگین به طور دقیق اجرا می‌شود.';
$string['admindefaultvisualsintro'] = 'زمانی که بلوک به یک دوره جدید اضافه می‌شود، تنظیمات زیر به عنوان تنظیمات پیش‌فرض استفاده خواهد شد.';
$string['addinstructions'] = 'اضافه کردن اطلاعات بیشتر';
$string['additionalresources'] = 'منابع اضافی';
$string['addoninstallationerror'] = 'مشکلی در نصب افزونه (local_xp) تشخیص داده شده است. باید یک مدیر نصب آن را تکمیل کند.';
$string['anonymity'] = 'ناشناسی';
$string['anonymity_help'] = 'این تنظیم کنترل می‌کند آیا شرکت‌کنندگان می‌توانند نام و آواتار یکدیگر را ببینند یا خیر.';
$string['apply'] = 'Apply';
$string['awardaxpwhen'] = '<strong>{$a}</strong> امتیاز دریافت می‌شود وقتی:';
$string['badgeaward'] = 'Badge to award';
$string['badgeawarddesc'] = 'A badge to award when the user attains the level.';
$string['basepoints'] = 'Base points';
$string['basepointslineardesc'] = 'The minimum increment between each level.';
$string['basepointsrelativedesc'] = 'The number of points to start with.';
$string['blockappearance'] = 'ظاهر بلوک';
$string['blockappearancemovedtopluginsettings'] = 'تنظیمات ظاهر بلوک به صفحه تنظیمات افزونه منتقل شدند.';
$string['cachedef_filters'] = 'فیلترهای سطوح';
$string['cachedef_ruleevent_eventslist'] = 'لیست برخی از رویدادها';
$string['cannotbesetindefaults'] = 'This cannot be set in the default values.';
$string['cannotearnpoints'] = 'Cannot earn points.';
$string['cannotshowblockconfig'] = 'معمولاً تنظیمات ظاهر را در اینجا نمایش می‌دهم، اما نتوانستم بلوک شما را پیدا کنم. برای تغییر ظاهر بلوک، به [اینجا]({$a}) (یا جایی که بلوک را اضافه کرده‌اید) برگردید، حالت ویرایش را فعال کنید و گزینه "پیکربندی" را در منوی کشویی بلوک دنبال کنید. اگر نمی‌توانید بلوک را پیدا کنید، آن را دوباره به دوره خود اضافه کنید.';
$string['cannotshowblockconfigsys'] = 'معمولاً تنظیمات ظاهر را در اینجا نمایش می‌دهم، اما نتوانستم بلوک شما را پیدا کنم. ممکن است از [صفحه اصلی]({$a->fp}) و [داشبورد پیش‌فرض]({$a->mysys}) کاربران شما کمبود داشته باشد یا در هر دو مکان حضور داشته باشد. برای ویرایش تنظیمات از اینجا، مطمئن شوید که تنها در یکی از آنها ظاهر می‌شود.';
$string['cheatguard'] = 'محافظت از تقلب';
$string['clicktoselectcm'] = 'برای انتخاب یک فعالیت یا منبع کلیک کنید';
$string['cmselector'] = 'انتخاب‌کننده ماژول دوره';
$string['coefxp'] = 'ضریب الگوریتم';
$string['colon'] = '{$a->a}: {$a->b}';
$string['compatibilitycheck'] = 'Compatibility check';
$string['configdescription'] = 'مقدمه';
$string['configdescription_help'] = 'پیام مختصری که در بلوک نمایش داده می‌شود. دانشجوها توانایی رد کردن پیام را دارند، در این صورت آنها آن را دوباره نخواهند دید.';
$string['configheader'] = 'تنظیمات';
$string['configtitle'] = 'عنوان';
$string['configtitle_help'] = 'عنوان بلوک.';
$string['configblockrankingsnapshot'] = 'نمایش تصویر لیدربورد';
$string['configblockrankingsnapshot_help'] = 'تصویر لیدربورد شماره رتبه‌ی کاربر را نمایش می‌دهد. همچنین تلاش می‌کند دو نفر اطراف کاربر را نمایش دهد. این ویژگی نیازمند فعال‌سازی لیدربورد و نمایش رتبه‌های آن است.';
$string['configrecentactivity'] = 'نمایش پاداش‌های اخیر';
$string['configrecentactivity_help'] = 'زمانی که فعال شود، بلوک یک لیست کوتاه از رویدادهای اخیر که دانشجو به ازای آن‌ها امتیاز دریافت کرده است، نمایش خواهد داد.';
$string['congratulationsyouleveledup'] = 'تبریک می‌گوییم!';
$string['coolthanks'] = 'عالی، متشکرم!';
$string['courselog'] = 'گزارش دوره';
$string['coursereport'] = 'گزارش دوره';
$string['courserules'] = 'قوانین دوره';
$string['courseselectedcolon'] = 'دوره انتخاب شده:';
$string['coursesettings'] = 'تنظیمات دوره';
$string['currencysign'] = 'Points symbol';
$string['currencysign_help'] = 'With this setting you can change the meaning of the points. It will be displayed next to the amount of points each user has as a substitute for the reference to _experience points_.

Choose one of the provided symbols, or upload your own!';
$string['currencysignxp'] = 'XP (Experience points)';
$string['customizelevels'] = 'شخصی‌سازی سطوح';
$string['dangerzone'] = 'منطقه خطر';
$string['defaultlevels'] = 'سطوح پیش‌فرض';
$string['defaultrules'] = 'قوانین پیش‌فرض';
$string['defaultrulesformhelp'] = 'این قوانین پیش‌فرض توسط پلاگین ارائه شده‌اند، به طور خودکار امتیازهای پیش‌فرض را اختصاص می‌دهند و برخی از رویدادهای تکراری را نادیده می‌گیرند. قوانین شخصی شما از آن‌ها اولویت دارند.';
$string['defaultsettings'] = 'تنظیمات پیش‌فرض';
$string['defaultvisuals'] = 'تصاویر پیش‌فرض';
$string['deletecondition'] = 'حذف شرط';
$string['deleterule'] = 'حذف قانون';
$string['description'] = 'توضیحات';
$string['difference'] = 'تفاوت';
$string['difficultyrelative'] = 'Snowballing';
$string['discoverlevelupplus'] = 'کشف Level Up XP+';
$string['dismissnotice'] = 'لغو اعلان';
$string['displayeveryone'] = 'نمایش همه';
$string['displaynneighbours'] = 'نمایش {$a} همسایه';
$string['displayoneneigbour'] = 'نمایش یک همسایه';
$string['displayparticipantsidentity'] = 'نمایش هویت شرکت‌کنندگان';
$string['displayrank'] = 'نمایش رتبه';
$string['displayrelativerank'] = 'نمایش یک رتبه نسبی';
$string['documentation'] = 'مستندات';
$string['drops'] = 'Drops';
$string['dropsintro'] = 'Drops are code snippets directly placed in content that award points when encountered by a user.';
$string['drops_help'] = '
In video games, some characters can _drop_ items or experience points on the ground for the player to pick up. These items and points are commonly referred to as drops.

In Level Up XP, drops are shortcodes (e.g. `[xpdrop abcdef]`) that an instructor can place in regular Moodle content. When encountered by a user, these drops will be _picked up_ and a certain amount of points will be awarded.

At present, drops are invisible to the user and passively award points the first time they are encountered.

Drops can be used to cleverly award points when certain type of content is consumed by a student. Here are some ideas:

- Place a drop in the feedback of a quiz only visible for perfect scores
- Place a drop in deep content to reward their consumption
- Place a drop in an interesting forum discussion
- Place a drop in a hard-to-get-to page in a lesson module

[More info](https://docs.levelup.plus/xp/docs/how-to/use-drops?ref=blockxp_help)
';
$string['editinstructions'] = 'ویرایش اطلاعات';
$string['enablecheatguard'] = 'فعال‌سازی محافظت از تقلب';
$string['enablecheatguard_help'] = 'محافظت از تقلب یک مکانیزم ساده و ارزان برای جلوگیری از سوء استفاده دانشجویان از سیستم با استفاده از تکنیک‌های آشکار مانند بی‌پایان تازه کردن یک صفحه یا تکرار کردن یک عملیات مشترک است.

[اطلاعات بیشتر](https://docs.levelup.plus/xp/docs/getting-started/cheat-guard?ref=blockxp_help)
';
$string['enableinfos'] = 'فعال‌سازی صفحه اطلاعات';
$string['enableinfos_help'] = 'زمانی که به \'نه\' تنظیم شود، دانشجوها نمی‌توانند صفحه اطلاعات را مشاهده کنند.';
$string['enableladder'] = 'فعال‌سازی جدول رده‌بندی';
$string['enableladder_help'] = 'زمانی که به \'نه\' تنظیم شود، دانشجوها نمی‌توانند جدول رده‌بندی را مشاهده کنند.';
$string['enablelevelupnotif'] = 'فعال‌سازی اعلان صعود سطح';
$string['enablelevelupnotif_help'] = 'زمانی که به \'بله\' تنظیم شود، به دانشجوها یک پنجره‌ی پنجره نمایش داده می‌شود که ایشان را بابت رسیدن به سطح جدید تبریک می‌گوید.';
$string['enablexpgain'] = 'فعال‌سازی کسب امتیاز';
$string['enablexpgain_help'] = 'زمانی که به \'نه\' تنظیم شود، هیچ کس در دوره امتیازی کسب نخواهد کرد. این برای تجمید امتیازهای کسب شده یا فعال‌سازی آن در زمان خاص مفید است.

لطفاً توجه داشته باشید که می‌توانید این قابلیت را با دقت بیشتری با استفاده از قابلیت _block/xp:earnxp_ کنترل کنید.';
$string['entersearchterm'] = 'یک عبارت جستجو وارد کنید';
$string['errorcontextcoursemismatchforwholesite'] = 'آدرس این صفحه <em>Level Up XP</em> با تنظیمات فعلی افزونه همخوانی ندارد. تنظیمات فعلی شما اعلام می‌کند که <em>Level Up XP</em> برای استفاده \'برای کل سایت\' باشد، اما این صفحه انتظار دارد که از آن \'در هر دوره\' استفاده شود. لطفاً <a href="{$a->nexturl}">اینجا کلیک کنید</a> تا به صفحه درست هدایت شوید. اگر می‌خواهید تنظیمات خود را تغییر دهید، به تنظیمات مدیریتی \'block_xp_context\' بروید.';
$string['errorcontextcoursemismatchpercourse'] = 'آدرس این صفحه <em>Level Up XP</em> با تنظیمات فعلی افزونه همخوانی ندارد. تنظیمات فعلی شما اعلام می‌کند که <em>Level Up XP</em> برای استفاده \'در هر دوره\' باشد، اما این صفحه انتظار دارد که از آن \'برای کل سایت\' استفاده شود. احتمالاً این از یک <em>بلوک</em> ایجاد شده است که به داشبورد یا صفحه اصلی اضافه شده است در حالی که تنظیمات متفاوتی دارد. شما باید بلوک را از صفحات آخر حذف کنید و تنها از بلوک در دوره‌های خاص استفاده کنید.';
$string['errorformvalues'] = 'مشکلاتی در مقادیر فرم وجود دارد، لطفاً آنها را تصحیح کنید.';
$string['errorlevelsincorrect'] = 'حداقل تعداد سطوح ۲ است';
$string['errornotalllevelsbadgesprovided'] = 'تمام نشان‌های سطح ارائه نشده‌اند. از دست رفته: {$a}';
$string['errorunknownevent'] = 'خطا: رویداد ناشناخته';
$string['errorunknownmodule'] = 'خطا: ماژول ناشناخته';
$string['errorxprequiredlowerthanpreviouslevel'] = 'امتیازهای مورد نیاز کمتر یا مساوی سطح قبلی است.';
$string['eventsrules'] = 'قوانین رویدادها';
$string['eventsrules_help'] = 'این پلاگین از رویدادها برای اختصاص امتیاز به اقداماتی که دانشجوها انجام می‌دهند، استفاده می‌کند.
می‌توانید از فرم زیر برای اضافه کردن قوانین خود و تغییر قوانین پیش‌فرض استفاده کنید.

توصیه می‌شود به صفحه _Log_ پلاگین مراجعه کنید تا رویدادهایی که دانشجوها در دوره انجام می‌دهند را شناسایی کنید.

منابع اضافی:

- [چگونه امتیازهای تجربه محاسبه می‌شوند؟](https://docs.levelup.plus/xp/docs/getting-started/points-calculation?ref=blockxp_help)
- [رفع مشکلات قوانین](https://docs.levelup.plus/xp/docs/troubleshooting/event-rule-not-working?ref=blockxp_help)
';
$string['event_user_leveledup'] = 'کاربر به سطح جدید رسید';
$string['eventis'] = 'رویداد {$a} است';
$string['eventname'] = 'نام رویداد';
$string['eventproperty'] = 'ویژگی رویداد';
$string['eventtime'] = 'زمان رویداد';
$string['filterbyuser'] = 'فیلتر بر اساس کاربر';
$string['filtermodules'] = 'فیلتر ماژول‌ها';
$string['forever'] = 'برای همیشه';
$string['forthewholesite'] = 'برای کل سایت';
$string['give'] = 'تخصیص دادن';
$string['gotofullladder'] = 'رفتن به جدول رده‌بندی کامل';
$string['graderules'] = 'Grade rules';
$string['grid'] = 'شبکه';
$string['hideparticipantsidentity'] = 'مخفی کردن هویت شرکت‌کنندگان';
$string['hiderank'] = 'مخفی کردن رتبه';
$string['incourses'] = 'در دوره‌ها';
$string['ineffective'] = 'ناکارآمد';
$string['infos'] = 'اطلاعات';
$string['installed'] = 'نصب شده';
$string['instructions'] = 'اطلاعات بیشتر';
$string['invalidxp'] = 'ارزش نامعتبر امتیاز';
$string['keeplogs'] = 'نگهداری گزارش‌ها';
$string['ladder'] = 'جدول رده‌بندی';
$string['ladderadditionalcols'] = 'ستون‌های اضافی';
$string['ladderadditionalcols_help'] = 'این تنظیم مشخص می‌کند که کدام ستون‌های اضافی در جدول رده‌بندی نمایش داده می‌شوند. برای انتخاب چندین ستون یا لغو انتخاب ستون انتخابی، کلید CTRL یا CMD را همراه با کلیک کنید.';
$string['ladderempty'] = 'در حال حاضر جدول رده‌بندی خالی است، حتماً بعداً برگردید!';
$string['learnmore'] = 'اطلاعات بیشتر';
$string['level'] = 'سطح';
$string['levelbadges'] = 'نشان‌های سطح';
$string['levelbadges_help'] = 'نام فایل‌ها را به صورت [سطح].[پسوند فایل] قرار دهید، به عنوان مثال: 1.png، 2.jpg، و غیره... اندازه تصویر توصیه‌شده ۱۰۰ در ۱۰۰ پیکسل است.';
$string['leveldescriptiondesc'] = 'A short description of the level, displayed to students on the information page.';
$string['levelpointsstart'] = 'شروع';
$string['levels'] = 'سطوح';
$string['levelup'] = 'صعود سطح!'; // عملیات، نه نام برند!
$string['levelupplus'] = 'Level Up XP+';
$string['levelx'] = 'سطح #{$a}';
$string['likenotice'] = '<strong>آیا پلاگین را دوست دارید؟</strong> لطفاً یک لحظه وقت بگذارید تا <a href="{$a->moodleorg}" target="_blank">آن را به مورد علاقه‌های خود اضافه کنید</a> در Moodle.org و در <a href="{$a->github}" target="_blank">GitHub آن را ستاره‌دار کنید</a>.';
$string['limitparticipants'] = 'محدود کردن شرکت‌کنندگان';
$string['limitparticipants_help'] = 'این تنظیم کنترل می‌کند که کدام شرکت‌کنندگان در جدول رده‌بندی نمایش داده می‌شوند. همسایگان شرکت‌کنندگان کسانی هستند که در رده‌بندی بالای و پایین کاربر فعلی قرار دارند. به عنوان مثال، هنگام انتخاب \'نمایش ۲ همسایه\'، تنها دو شرکت‌کننده درجه یک رتبه بالاتر و پایین‌تر از کاربر فعلی نمایش داده خواهند شد.';
$string['list'] = 'لیست';
$string['logging'] = 'ثبت رویدادها';
$string['manually'] = 'دستی';
$string['maxactionspertime'] = 'حداکثر اقدامات در بازه زمانی';
$string['maxactionspertime_help'] = 'حداکثر تعداد اقداماتی که در بازه زمانی داده شده برای امتیاز‌دهی محاسبه می‌شود. هر اقدام بعدی نادیده گرفته می‌شود. وقتی این مقدار خالی یا برابر با صفر است، اعمال نمی‌شود.';
$string['maxlevelexcl'] = 'حداکثر سطح!';
$string['menu'] = 'منو';
$string['missing'] = 'گم‌شده';
$string['movecondition'] = 'انتقال شرط';
$string['moverule'] = 'انتقال قانون';
$string['name'] = 'نام';
$string['navdrops'] = 'Drops';
$string['navinfos'] = 'اطلاعات';
$string['navladder'] = 'جدول رده‌بندی';
$string['navlevels'] = 'سطوح';
$string['navlevelssetup'] = 'تنظیمات';
$string['navlog'] = 'گزارش';
$string['navpoints'] = 'امتیازها';
$string['navpromo'] = 'XP+';
$string['navreport'] = 'گزارش';
$string['navrules'] = 'قوانین';
$string['navsettings'] = 'تنظیمات';
$string['navvisuals'] = 'تصاویر';
$string['nextlevelin'] = 'سطح بعدی در';
$string['nodescription'] = 'بدون توضیحات';
$string['noissuesidentified'] = 'No issues identified';
$string['nologsrecordedyet'] = 'هنوز گزارش‌ها ثبت نشده‌اند.';
$string['noname'] = 'بدون نام';
$string['notesomesettingslocked'] = 'لطفاً توجه داشته باشید که برخی از تنظیمات ممکن است قابل ویرایش نباشند وقتی توسط مدیر قفل شده‌اند.';
$string['occasionally'] = 'گاهی';
$string['participant'] = 'شرکت‌کننده';
$string['participants'] = 'شرکت‌کنندگان';
$string['participatetolevelup'] = 'شرکت در دوره برای کسب امتیاز تجربه و صعود سطح!';
$string['perpagecolon'] = 'در هر صفحه:';
$string['pickaconditiontype'] = 'نوع شرط را انتخاب کنید';
$string['pluginavailabilityxpdesc'] = 'این پلاگین به اساتید امکان می‌دهد که دسترسی به فعالیت‌ها را بر اساس سطح دانشجویان محدود کنند.';
$string['pluginenrolxpdesc'] = 'این پلاگین امکان ثبت نام خودکار در دوره‌ها را بر اساس سطح دانشجو در دوره دیگری فراهم می‌کند.';
$string['pluginshortcodesdesc'] = 'این پلاگین به اساتید اجازه می‌دهد تا محتوای خود را با اضافه کردن عناصر مرتبط با امتیاز تجربه (امتیازات، سطح، جدول رده‌بندی، ...) سفارشی کنند، همچنین با توجه به سطح دانشجو محتوا را مخفی یا نمایش دهند.';
$string['pluginname'] = 'Level Up XP';
$string['pluginsoutofsync'] = '__پلاگین‌ها از هماهنگی خارج شده‌اند!__

این به این معنی است که شما _Level Up XP_ را ارتقا داده‌اید، اما _Level Up XP+_ را نه. هرچند ما تلاش می‌کنیم تا مشکلات را به حداقل برسانیم، اما برخی از ویژگی‌ها ممکن است دیگر به درستی کار نکنند، از جمله در _Level Up XP_ خود. ما توصیه می‌کنیم _Level Up XP+_ را به آخرین نسخه ارتقا دهید. [اطلاعات بیشتر]({$a->url})';
$string['pointsintimelinker'] = 'در';
$string['pointsrequired'] = 'امتیازهای مورد نیاز';
$string['privacy:path:addon'] = 'افزونه';
$string['privacy:path:level'] = 'سطح';
$string['privacy:path:logs'] = 'گزارش‌ها';
$string['privacy:metadata:log'] = 'یک گزارش از رویدادها ذخیره می‌کند';
$string['privacy:metadata:log:eventname'] = 'نام رویداد';
$string['privacy:metadata:log:time'] = 'تاریخی که رویداد اتفاق افتاد';
$string['privacy:metadata:log:userid'] = 'کاربری که امتیازات را کسب کرد';
$string['privacy:metadata:log:xp'] = 'امتیازهای اختصاص داده شده به رویداد';
$string['privacy:metadata:prefintro'] = 'ثبت می‌کند که کاربر توضیح مقدماتی بلوک را رد کرده یا نه';
$string['privacy:metadata:preflevelup'] = 'ثبت می‌کند که کاربر باید اعلان صعود سطح را ببیند یا نه';
$string['privacy:metadata:prefnotices'] = 'ثبت می‌کند که کاربر اعلان پشتیبانی را ببندد یا نه';
$string['privacy:metadata:prefseenpromo'] = 'ثبت می‌کند که کاربر صفحه تبلیغاتی را مشاهده کرده یا نه';
$string['privacy:metadata:prefladderpagesize'] = 'اندازه صفحه ترجیحی کاربر هنگام مشاهده جدول رده‌بندی';
$string['privacy:metadata:xp'] = 'امتیازها و سطوح کاربران را ذخیره می‌کند';
$string['privacy:metadata:xp:xp'] = 'امتیازهای کاربر';
$string['privacy:metadata:xp:userid'] = 'کاربر';
$string['progress'] = 'پیشرفت';
$string['progressbar'] = 'نوار پیشرفت';
$string['property:action'] = 'عملیات رویداد';
$string['property:component'] = 'اجزای رویداد';
$string['property:crud'] = 'CRUD رویداد';
$string['property:eventname'] = 'نام رویداد';
$string['property:target'] = 'هدف رویداد';
$string['promocheatguard'] = 'این حافظه‌ی دستکاری کاربر را برای بازه‌های زمانی بلند طراحی نشده است. لطفاً به نظر بگیرید که به نسخه <em>Level Up XP+</em> ارتقا دهید تا بازه‌های زمانی بزرگتر و ویژگی‌های دیگر را برای خود فعال کنید. <a href="{$a->url}">اطلاعات بیشتر را در اینجا بخوانید</a>.';
$string['promointro'] = 'به سرمایه‌گذاری Level Up XP خوش آمدید و ظرفیت کامل آن را از طریق Level Up XP+ را اعمال کنید! ویژگی‌های اضافی را با Level Up XP+ بفتح کنید!';
$string['promointroinstalled'] = 'افزونه _Level Up XP+_ در سیستم شما نصب شده است و تمام ویژگی‌های آن فعال شده است.';
$string['promorulesdidyouknow'] = 'آیا می‌دانستید که با استفاده از <em>Level Up XP+</em> دانشجوها می‌توانند امتیازات را برای <em>تکمیل دوره‌ها</em> و <em>فعالیت‌ها</em> دریافت کنند، یا حتی بر اساس <em>نمرات</em> امتیاز بگیرند؟ <a href="{$a->url}">اطلاعات بیشتر را در اینجا کشف کنید</a>.';
$string['questreleasenotice'] = '🎉 ما به افتخار معرفی افزونه **جدید ماجراجویی Level Up** به نام **Level Up Quest** هستیم 🥳. دوره‌های خود را به ماجراجویی‌های **جذاب** تبدیل کنید، پر از استراتژی‌های **بازآوری** و **جشن‌ها** 🤯! [وب‌سایت Quest را بررسی کنید]({$a->questurl}) و [پست راه‌اندازی را اینجا بخوانید]({$a->questblogurl}). 👈';
$string['rank'] = 'رتبه';
$string['ranking'] = 'رتبه‌بندی';
$string['ranking_help'] = 'رتبه موقعیت مطلق کاربر فعلی در جدول رده‌بندی است. رتبه نسبی تفاوت امتیاز تجربه بین کاربر و همسایگانش است.';
$string['reallydeleteuserstate'] = 'حذف کاربر تنها برای حذف او از جدول رده‌بندی مفید است. برای دلایل دیگر، توصیه می‌کنیم که امتیازات او را به 0 تنظیم کنید. توجه کنید که حذف او توانایی اخذ امتیازات آینده را تحت تاثیر قرار نمی‌دهد.

به عنوان مهم، هنگام استفاده از _Level Up XP_ برای کل سایت، حذف او باعث ناپدید شدن او از گزارش می‌شود، در این صورت قادر به اختصاص دوباره امتیاز به او نخواهید بود. با این حال، اگر از _Level Up XP_ برای هر دوره استفاده می‌کنید، ممکن است دانشجو در گزارش ظاهر شود اگر در دوره ثبت نام کرده باشد.

آیا واقعاً می‌خواهید امتیازات این کاربر را حذف کنید؟';
$string['reallydeleteuserstateandlogs'] = 'حذف یک کاربر باعث حذف او از جدول رده‌بندی و حذف تمامی وقایع مرتبط با او خواهد شد.

حذف وقایع ممکن است اجازه دهد تا کاربر بتواند برای اقدامات قبلی دوباره امتیاز کسب کند. اگر قصد شما فقط تنظیم مجدد امتیازاتشان باشد، توصیه می‌شود امتیازاتشان را به 0 تنظیم کنید. توجه داشته باشید که حذف یک کاربر توانایی اخذ امتیازات آینده او را تحت تاثیر نمی‌گذارد.

به عنوان مهم، هنگام استفاده از _Level Up XP_ برای کل سایت، حذف او باعث ناپدید شدن او از گزارش می‌شود، در این صورت قادر به اختصاص دوباره امتیاز به او نخواهید بود. با این حال، اگر از _Level Up XP_ برای هر دوره استفاده می‌کنید، ممکن است دانشجو در گزارش ظاهر شود اگر در دوره ثبت نام کرده باشد.

آیا واقعاً می‌خواهید امتیازات و وقایع این کاربر را حذف کنید؟';
$string['reallyresetallcoursestodefaults'] = 'آیا واقعاً می‌خواهید تمام قوانین دوره‌ها را به قوانین پیش‌فرض تنظیم مجدد کنید؟ این اقدام قابل بازگشت نیست.';
$string['reallyresetcourserulestodefaults'] = 'آیا واقعاً می‌خواهید قوانین دوره را به قوانین پیش‌فرض تنظیم مجدد کنید؟ این اقدام قابل بازگشت نیست.';
$string['reallyresetdata'] = 'آیا واقعاً می‌خواهید سطوح و امتیازات همه افراد در این دوره را تنظیم مجدد کنید؟';
$string['reallyresetgroupdata'] = 'آیا واقعاً می‌خواهید سطوح و امتیازات همه افراد در این گروه را تنظیم مجدد کنید؟';
$string['reallyreverttopluginsdefaults'] = 'آیا واقعاً می‌خواهید قوانین پیش‌فرض را به قوانین پیش‌فرض پیشنهاد شده توسط افزونه تنظیم مجدد کنید؟ این اقدام قابل بازگشت نیست.';
$string['recentrewards'] = 'پاداش‌های اخیر';
$string['recommendedplugins'] = 'افزونه‌های پیشنهادی';
$string['releasenotes'] = 'یادداشت‌های نسخه';
$string['remaining'] = 'باقی‌مانده';
$string['removefilter'] = 'حذف فیلتر';
$string['reportisempty'] = 'گزارش خالی است، دانشجوها هنوز امتیاز کسب نکرده‌اند.';
$string['reportisemptyenrolstudents'] = 'گزارش خالی است، آیا دانشجوها در این دوره ثبت نام کرده‌اند؟';
$string['resetcoursedata'] = 'تنظیم مجدد داده‌های دوره';
$string['resetallcoursestodefaults'] = 'تنظیم مجدد همه دوره‌ها به حالت پیش‌فرض';
$string['resetallcoursestodefaultsintro'] = 'برای تنظیم مجدد همه دوره‌ها به پیش‌فرض‌های فوق، دکمه زیر را فشار دهید.';
$string['resetcourserulestodefaults'] = 'تنظیم مجدد قوانین دوره به حالت پیش‌فرض';
$string['resetgroupdata'] = 'تنظیم مجدد داده‌های گروه';
$string['resultsfilteredforn'] = 'نتایج برای {$a} فیلتر شده‌اند.';
$string['reward'] = 'پاداش';
$string['requires'] = 'نیازمند';
$string['reverttopluginsdefaults'] = 'بازگشت به پیش‌فرض‌های افزونه';
$string['reverttopluginsdefaultsintro'] = 'از دکمه زیر استفاده کنید اگر می‌خواهید پیش‌فرض‌های فوق به پیش‌فرض‌های افزونه بازگردانده شوند. این تأثیری بر روی قوانین در دوره‌های موجود ندارد.';
$string['rule'] = 'قانون';
$string['rule:contains'] = 'شامل می‌شود';
$string['rule:eq'] = 'برابر است با';
$string['rule:eqs'] = 'به طور دقیق برابر است با';
$string['rule:gt'] = 'بزرگتر است از';
$string['rule:gte'] = 'بزرگتر یا مساوی است با';
$string['rule:lt'] = 'کوچکتر است از';
$string['rule:lte'] = 'کوچکتر یا مساوی است با';
$string['rule:regex'] = 'با الگوی منطبق است';
$string['rulecm'] = 'فعالیت یا منبع';
$string['rulecm_help'] = 'این شرط در زمانی برقرار می‌شود که رویداد در فعالیت یا منبع مشخص شده رخ دهد.';
$string['rulecmdesc'] = 'فعالیت یا منبع \'{$a->contextname}\' است.';
$string['rulecmdescwithcourse'] = 'فعالیت یا منبع: \'{$a->contextname}\' در \'{$a->coursename}\' است.';
$string['rulecminfo'] = 'این شرط نیازمند این است که عمل در یک فعالیت یا منبع خاص انجام شود.';
$string['ruleevent'] = 'رویداد خاص';
$string['ruleeventdesc'] = 'رویداد \'{$a->eventname}\' است.';
$string['ruleeventinfo'] = 'از بین لیستی از رویدادها، عملی که کاربران باید انجام دهند را انتخاب کنید.';
$string['ruleproperty'] = 'خاصیت رویداد';
$string['rulepropertydesc'] = 'ویژگی \'{$a->property}\' {$a->compare} \'{$a->value}\' است.';
$string['rulepropertyinfo'] = 'این شرط برای کاربران حرفه‌ای با فهم فنی از رویدادها و ویژگی‌های آنها مناسب است.';
$string['ruleset'] = 'مجموعه‌ی شرایط';
$string['ruleset:all'] = 'همه‌ی شرایط درست هستند';
$string['ruleset:any'] = 'هرکدام از شرایط درست هستند';
$string['ruleset:none'] = 'هیچ یک از شرایط درست نیستند';
$string['rulesetinfo'] = 'چندین شرط را ترکیب کنید.';
$string['searchandselectcourse'] = 'جستجو و انتخاب یک دوره';
$string['searchandselectmodule'] = 'جستجو و انتخاب یک فعالیت یا منبع';
$string['send'] = 'ارسال';
$string['setpoints'] = 'تنظیم امتیازها';
$string['shortcode:xpbadge'] = 'نشانی که با سطح کاربر کنونی تطابق دارد.';
$string['shortcode:xpladder'] = 'یک بخشی از جدول رده‌بندی را نمایش دهید.';

$string['shortcode:xpladder_help'] = '
به طور پیش‌فرض، یک بخشی از جدول رده‌بندی اطراف کاربر کنونی نمایش داده می‌شود.

```
[xpladder]
```

برای نمایش ۱۰ دانشجوی برتر به جای همسایگان کاربر کنونی، پارامتر `top` را تنظیم کنید. می‌توانید به صورت اختیاری تعداد کاربرانی که نمایش داده می‌شوند را مشخص کنید، به این صورت `top=20`.

```
[xpladder top]
[xpladder top=15]
```

پیوندی به جدول رده‌بندی کامل به طور خودکار پایین‌تر از جدول نمایش داده خواهد شد، اگر نمی‌خواهید چنین پیوندی را نمایش دهید، آرگومان `hidelink` را اضافه کنید.

```
[xpladder hidelink]
```

به طور پیش‌فرض، جدول شامل ستون پیشرفت که نوار پیشرفت را نمایش می‌دهد، نمی‌باشد. اگر این ستون در ستون‌های اضافی در تنظیمات جدول رده‌بندی انتخاب شده باشد، می‌توانید از آرگومان `withprogress` برای نمایش آن استفاده کنید.

```
[xpladder withprogress]
```

لطفاً توجه داشته باشید که هنگامی که یک دوره از گروه‌ها استفاده می‌کند، جدول رده‌بندی بهترین حدسی را خواهد زد که کدام گروه برای نمایش جدول رده‌بندی مناسب است.
';

$string['shortcode:xpiflevel'] = 'Display the content when the current user\'s level matches.';
$string['shortcode:xpiflevel_help'] = '
برای قالب‌بندی این کدهای میانبر، به مثال‌های زیر مراجعه کنید. وقتی یک سطح به طور دقیق مشخص شده است، محتوا به هر حال از سایر قوانین نمایش داده خواهد شد.
قوانین _بزرگتر_ و _کوچکتر_ باید همه به یکدیگر متناظر شوند تا محتوا نمایش داده شود. با اینکه این موارد بعضاً ممکن است منجر به عدم نمایش محتوا شود!
توجه داشته باشید که معلمان یا کاربرانی که دارای توانایی ویرایش هستند، همیشه همه چیز را خواهند دید.

```
[xpiflevel 1 3 5]
    نمایش داده می‌شود اگر سطح کاربر دقیقاً 1، 3 یا 5 باشد.
[/xpiflevel]

[xpiflevel >3]
    نمایش داده می‌شود اگر سطح کاربر بیشتر از 3 باشد.
[/xpiflevel]

[xpiflevel >=3]
    نمایش داده می‌شود اگر سطح کاربر بزرگتر یا مساوی با 3 باشد.
[/xpiflevel]

[xpiflevel >=10 <20 30]
    نمایش داده می‌شود اگر سطح کاربر بزرگتر یا مساوی با 10 باشد و به طور دقیق کمتر از 20 باشد
    یا دقیقاً برابر با 30 باشد.
[/xpiflevel]

[xpiflevel <=10 >=20]
    هرگز نمایش داده نخواهد شد زیرا سطح کاربر هرگز نمی‌تواند کمتر یا مساوی با 10 و بیشتر یا مساوی با 20 باشد.
[/xpiflevel]
```

لطفاً توجه داشته باشید که این کدهای میانبر نمی‌توانند در یکدیگر تو در تو قرار بگیرند.
';

$string['shortcode:xplevelname_help'] = '
به طور پیش‌فرض، این برچسب نام سطح کاربر کنونی را نمایش می‌دهد.
همچنین، می‌توانید از آرگومان `level` برای نمایش نام یک سطح مشخص استفاده کنید.

```
[xplevelname]
[xplevelname level=5]
```

در صورتی که آرگومان `level` ارائه شود و سطح وجود نداشته باشد، هیچ موردی نمایش داده نخواهد شد.
';

$string['somefeaturesrequireotherplugins'] = 'بعضی از ویژگی‌ها نیاز به نصب افزونه‌های دیگر دارند.';
$string['someoneelse'] = 'کس دیگری';
$string['somethinghappened'] = 'چیزی اتفاق افتاد';
$string['taskcollectionloggerpurge'] = 'پاک کردن لاگ‌های مجموعه';
$string['taskusagereport'] = 'گزارش استفاده';
$string['total'] = 'جمع کل';
$string['thankyou'] = 'با تشکر!';
$string['timebetweensameactions'] = 'زمان مورد نیاز بین اقدام‌های یکسان';
$string['timebetweensameactions_help'] = 'حداقل زمان مورد نیاز قبل از اینکه یک اقدامی که قبلاً رخ داده‌است، دوباره قبول شود. یک اقدام مشابه در نظر گرفته می‌شود اگر در همان زمان و شیء انجام شود، مثلاً خواندن یک پست در انجمن اگر همان پست دوباره خوانده شود، به عنوان اقدام مشابه در نظر گرفته می‌شود. وقتی این مقدار خالی باشد یا برابر با صفر باشد، اعمال نمی‌شود.';
$string['timeformaxactions'] = 'فاصله‌ی زمانی برای حداکثر تعداد اقدام‌ها';
$string['timeformaxactions_help'] = 'بازه‌ی زمانی (به ثانیه) در طول آن، کاربر نباید تعداد ماکزیممی از اقدام‌ها را بیش‌تر کند.';
$string['tinytimenow'] = 'اکنون';
$string['tinytimeseconds'] = '{$a}s';
$string['tinytimeminutes'] = '{$a}m';
$string['tinytimehours'] = '{$a}h';
$string['tinytimedays'] = '{$a}d';
$string['tinytimeweeks'] = '{$a}w';
$string['tinytimewithinayearformat'] = '%e %b'; // نه، این یک عبارت منظم نیست! @codingStandardsIgnoreLine.
$string['tinytimeolderyearformat'] = '%b %Y';
$string['unlockfeaturewithxpplus'] = 'Unlock this feature with XP+. <a href="{$a}">Learn more</a>';
$string['upgradingplugins'] = 'ارتقاء افزونه‌ها';
$string['value'] = 'مقدار';
$string['visualsintro'] = 'تصاویر را بارگذاری کنید تا ظاهر سطوح را سفارشی کنید.';
$string['wherearexpused'] = 'نقاط در کجا استفاده می‌شوند؟';
$string['wherearexpused_desc'] = 'وقتی به \'در دوره‌ها\' تنظیم شود، نقاط کسب شده فقط در دوره‌ای که بلوک به آن اضافه شده است محاسبه می‌شود. وقتی به \'برای کل سایت\' تنظیم شود، کاربر به جای انتخابی در هر دوره، در کل سایت "سطح بالا" می‌رود و تمام نقاط کسب شده در سراسر سایت استفاده خواهند شد.';
$string['updateandpreview'] = 'به‌روزرسانی و پیش‌نمایش';
$string['urlaccessdeprecated'] = 'دسترسی از طریق این URL منسوخ شده است، لطفاً پیوندهای خود را به‌روزرسانی کنید.';
$string['usagereport'] = 'گزارش استفاده را به اشتراک بگذارید';
$string['usagereport_desc'] = 'دوره‌ای اطلاعات استفاده ناشناس را با توسعه‌دهندگان افزونه به اشتراک بگذارید. این اطلاعات به بهتر درک کردن چگونگی استفاده از افزونه و تأثیر بر روی توسعه‌اش کمک می‌کند. اطلاعات به اشتراک‌گذاری شده شامل اطلاعات اساسی درباره سایت Moodle (URL، نسخه) و اطلاعات استفاده از افزونه (تعداد کاربرانی که امتیازات کسب کرده‌اند، نمای کلی تنظیمات، قوانین استفاده شده، ...) می‌شود.';
$string['usealgo'] = 'استفاده از الگوریتم';
$string['usecustomlevelbadges'] = 'استفاده از نشان‌های سطح سفارشی';
$string['usecustomlevelbadges_help'] = 'وقتی به بله تنظیم شود، باید برای هر سطح یک تصویر ارائه دهید.';
$string['unknownbadgea'] = 'Unknown badge ({$a})';
$string['unknowneventa'] = 'رویداد ناشناخته ({$a})';
$string['viewas'] = 'نمایش به عنوان';
$string['viewlogs'] = 'مشاهده‌ی گزارش‌ها';
$string['when'] = 'زمان';
$string['whoops'] = 'اوه!';
$string['wewillreplyat'] = 'ما پاسخ خواهیم داد در: _{$a}_.';
$string['xp:addinstance'] = 'افزودن یک بلوک جدید';
$string['xp:earnxp'] = 'کسب امتیازات';
$string['xp:manage'] = 'مدیریت همه جوانب امتیازهای تجربه';
$string['xp:myaddinstance'] = 'افزودن بلوک به داشبورد من';
$string['xp:view'] = 'مشاهده‌ی بلوک و صفحات مرتبط با آن';
$string['xp:viewlogs'] = 'مشاهده‌ی گزارش‌ها';
$string['xp:viewreport'] = 'مشاهده‌ی گزارش';
$string['xpplusrequired'] = 'XP+ required';
$string['xpgaindisabled'] = 'کسب نقاط غیرفعال است';
$string['youleveledupexcl'] = 'You levelled up!';
$string['youreachedlevel'] = 'شما به سطح رسیده‌اید:';
$string['youreachedlevela'] = 'شما به سطح {$a} رسیده‌اید!';
$string['yourmessage'] = 'پیام شما';
$string['yourownrules'] = 'قوانین شما';

// Deprecated since 3.13.0.
$string['xptogo'] = '[[{$a}]] to go';

// Deprecated since 3.15.0
$string['basexp'] = 'ضریب الگوریتم پایه';
$string['coursevisuals'] = 'تصاویر دوره';
$string['levelbadgesformhelp'] = 'Name the files [level].[file extension], for instance: 1.png, 2.jpg, etc... The recommended image size is 100x100.';
$string['levelcount'] = 'تعداد سطوح';
$string['leveldesc'] = 'توضیحات سطح';
$string['leveldesc_help'] = 'یک توضیح کوتاه از سطح، که در صفحه اطلاعات به همراه خود سطح نمایش داده می‌شود. می‌توانید از این قسمت برای توضیح مکافاتی برای کارآموزانی که به این سطح می‌رسند، دادن دستورات برای کار به سمت این سطح، توصیف سطح به یک نحوه‌ی بازی‌آمیز (مثلاً _تنها جرات‌کنندگان به این سطح دست یافته‌اند_) و غیره استفاده کنید.';
$string['levelname'] = 'نام سطح';
$string['levelname_help'] = 'یک نام کوتاه برای نمایش به جای _سطح #۱_، _سطح #۲_ و غیره که گاهاً نمایش داده می‌شود. اگر به برخی از سطوح نام می‌دهید، توصیه می‌شود به همه آنها نام دهید!';
$string['privacy:metadata:xp:lvl'] = 'سطح کاربر';
$string['usingalgo'] = 'استفاده از الگوریتم';
$string['valuessaved'] = 'مقادیر با موفقیت ذخیره شدند.';

$string['addlevel'] = 'اضافه کردن سطح';
$string['addrulesformhelp'] = 'ستون آخر میزان امتیاز تجربه به دست آمده در هنگام برآورده شدن معیارها را مشخص می کند.';
$string['adminscanearnxp'] = 'مدیران می‌توانند امتیاز کسب کنند';
$string['adminscanearnxp_desc'] = 'به طور پیش فرض، مدیران در گروه کاربرانی قرار نمی‌گیرند که می‌توانند امتیاز کسب کنند. زیرا که مدیران همیشه مجوز _block/xp:earnxp_ را دارند که به آنها اجازه می‌دهد به طور مداوم در همه جا امتیاز جمع آوری کنند. می‌توانید از این تنظیم استفاده کنید تا به مدیران اجازه دهید امتیاز کسب کنند.';
$string['apply'] = 'اعمال';
$string['badgeaward'] = 'نشان جایزه';
$string['badgeawarddesc'] = 'نشانی برای جایزه زمانی که کاربر به سطحی برسد.';
$string['basepoints'] = 'امتیازات پایه';
$string['basepointslineardesc'] = 'حداقل افزایش بین هر سطح.';
$string['basepointsrelativedesc'] = 'تعداد امتیاز برای شروع.';
$string['cannotbesetindefaults'] = 'این را نمی‌توان در مقادیر پیش فرض تنظیم کرد.';
$string['cannotearnpoints'] = 'نمی‌توان امتیاز کسب کرد.';
$string['changelevelformhelp'] = 'اگر تعداد سطوح را تغییر دهید، نشان‌های سطح سفارشی به طور موقت غیرفعال می‌شوند تا از سطوح بدون نشان جلوگیری شود. اگر تعداد سطوح را تغییر دادید، به صفحه "تصاویر" بروید تا پس از ذخیره این فرم، نشان‌های سفارشی را دوباره فعال کنید.';
$string['compatibilitycheck'] = 'بررسی سازگاری';
$string['currencysign_help'] = 'با این تنظیمات می‌توانید معنی نقاط را تغییر دهید. در کنار میزان امتیازی که هر کاربر دارد به عنوان جایگزینی برای مرجع _امتیازات_تجربه_ نمایش داده می شود. یکی از نمادهای ارائه شده را انتخاب کنید یا نماد خود را آپلود کنید!';
$string['difficulty'] = 'روش محاسبه امتیاز';
$string['difficultyflat'] = 'برابر';
$string['difficultyflatdesc'] = 'همه سطوح برای دستیابی به تعداد امتیازات یکسانی نیاز دارند.';
$string['difficultylinear'] = 'در حال افزایش';
$string['difficultylineardesc'] = 'رسیدن تدریجی به سطوح زمان بیشتری می‌برد.';
$string['difficultylinearincrdesc'] = 'تعداد امتیازهای استفاده شده برای سختی پیشرونده.';
$string['difficultypointincrease'] = 'افزایش امتیاز';
$string['difficultyrelativedesc'] = 'رسیدن به سطوح به طور تصاعدی دشوارتر می شود.';
$string['difficultyrelativeincrdesc'] = 'درصد امتیازها نسبت به سطح قبلی افزایش می‌یابد.';
$string['editingdefaultsettingsinwholesitemodenotice'] = '**توجه!** شما تنظیمات فعال فعلی را تغییر نمی‌دهید، در عوض مقادیر پیش‌فرض را ویرایش می‌کنید. از آنجایی که Level Up XP در سراسر سایت استفاده می‌شود، به احتمال زیاد قصد شما تغییر تنظیمات در سطح سایت است. [اینجا] ({$a->url}) را برای تغییر آن تنظیمات دنبال کنید، یا پیوند "تنظیمات" را از خود بلوک XP دنبال کنید.';
$string['enablelogging'] = 'فعال کردن لاگ کردن';
$string['eventsrulesintro'] = 'اعمال را مشاهده کنید و هنگام انجام آنها به دانش آموزان امتیاز دهید.';
$string['for1day'] = 'برای یک روز';
$string['for1month'] = 'برای یک ماه';
$string['for1week'] = 'برای یک هفته';
$string['for3days'] = 'برای سه روز';
$string['graderules'] = 'قوانین نمره دهی';
$string['graderules_help'] = 'دانش آموزان به اندازه نمره خود امتیاز کسب خواهند کرد. نمره 5/10 و نمره 5/100 هر دو به دانش آموز 5 امتیاز می‌دهد. زمانی که نمره دانش آموز چندین بار تغییر کند، امتیازی برابر با حداکثر نمره‌ای که دریافت کرده است، کسب می‌کند. هرگز از دانش آموزان امتیاز گرفته نمی‌شود و نمره منفی نادیده گرفته می‌شود. مثال: آلیس یک تکلیف را ارسال می‌کند و نمره 40/100 را دریافت می‌کند. در _Level Up XP_، آلیس 40 امتیاز برای نمره خود دریافت می‌کند. آلیس دوباره تکلیف خود را امتحان می‌کند، اما این بار نمره او به 25/100 کاهش می‌یابد. امتیاز آلیس در _Level Up XP_ تغییر نمی‌کند. برای آخرین تلاش خود، آلیس 60/100 امتیاز می‌گیرد، او 20 امتیاز اضافی در _Level Up XP_ به دست می‌آورد، مجموع امتیازهای کسب شده او 60 است. [اطلاعات بیشتر در _Level Up XP_ documentation](https://docs.levelup.plus/xp/ docs/how-to/grade-based-rewards?ref=blockxp_help)';
$string['graderulesintro'] = 'قوانین نمره به کاربران اجازه می‌دهد تا امتیازی برابر با نمرات دریافتی خود دریافت کنند.';
$string['hasbadgeaward'] = 'نشان به مجموعه جایزه';
$string['hasdescription'] = 'مجموعه توضیحات';
$string['hasname'] = 'مجموعه نام';
$string['hasnobadgeaward'] = 'بدون نشان برای جایزه';
$string['hasnodescription'] = 'بدون توضیح';
$string['hasnoname'] = 'بدون نام';
$string['hasnopopupmessage'] = 'پیام پاپ‌آپ وجود ندارد';
$string['haspopupmessage'] = 'مجموعه پیام پاپ‌آپ وجود ندارد';
$string['importpoints'] = 'وارد کردن امتیازات';
$string['importpoints_help'] = 'واردات ممکن است برای _افزایش_ امتیاز دانش‌آموزان، یا نادیده گرفتن آنها با مقدار ارائه شده استفاده شود. توجه داشته باشید که import __no___ از همان قالب گزارش صادر شده استفاده می کند. قالب مورد نیاز در [docmentation] (https://docs.levelup.plus/xp/docs/how-to/import-points/importing-points-from-csv?ref=localxp_help) توضیح داده شده است، جایی که یک [نمونه فایل](https://docs.levelup.plus/xp/docs/how-to/import-points/importing-points-from-csv?ref=localxp_help#sample-file) موجود است.';
$string['importpointsintro'] = 'امتیازها را از یک فایل CSV وارد کنید و به صورت اختیاری برای گیرنده پیام ارسال کنید.';
$string['leveldescriptiondesc'] = 'شرح کوتاهی از سطح، در صفحه اطلاعات برای دانش آموزان نمایش داده می‌شود.';
$string['levelpointslength'] = 'طول';
$string['levelsappearance'] = 'ظاهر سطوح';
$string['levelssaved'] = 'سطوح ذخیره شده اند.';
$string['levelswillbereset'] = 'هشدار! ذخیره این فرم سطوح همه افراد را دوباره محاسبه می کند!';
$string['levelupoptionsunavailableforlevelone'] = 'گزینه‌های مربوط به رسیدن به سطح برای سطح اول در دسترس نیست.';
$string['navbardisplay'] = 'نمایش در نوار ناوبری';
$string['navbardisplay_desc'] = 'هنگامی که فعال باشد، سطح کاربر در نوار ناوبری بالا نمایش داده می‌شود. اگر از افزونه "در هر دوره" استفاده شود، فقط در دوره ها ظاهر می‌شود. لطفاً توجه داشته باشید که این عملکرد به شدت به موضوع بستگی دارد و ممکن است با مضامین شخص ثالث خوب یا اصلاً کار نکند. [بیشتر بیاموزید](https://docs.levelup.plus/xp/docs/navbar-display)';
$string['naveventrules'] = 'قوانین رویداد';
$string['navgraderules'] = 'قوانین نمره دهی';
$string['navimport'] = 'وارد کردن';
$string['notecompatibilityissues'] = 'لطفاً به مشکلات سازگاری مشخص شده در زیر توجه کنید:';
$string['numberoflevels'] = 'تعداد سطوح';
$string['outofsync'] = 'هماهنگ نیست';
$string['outofsyncexcessive'] = 'بیش از حد ناهماهنگ';
$string['outofsyncexcessiveinfo'] = 'XP+ بیش از حد قدیمی تر از XP است که می‌تواند منجر به مشکلات غیرمنتظره شود. برای جلوگیری از عملکرد نادرست، XP+ ممکن است در آینده به طور خودکار خود را غیرفعال کند.';
$string['outofsyncinfo'] = 'پلاگین‌های XP با یکدیگر سازگار نیستند که می‌تواند منجر به مشکلات غیرمنتظره شود.';
$string['pluginxmaybeincompatible'] = 'این نسخه از {$a->name} ({$a->component}) ممکن است با مودل {$a->version} ناسازگار باشد.';
$string['pointsperlevel'] = 'امتیاز در هر سطح';
$string['popupnotificationmessage'] = 'پیام اعلان پاپ‌آپ';
$string['popupnotificationmessagedesc'] = 'پیام اختیاری برای نمایش در اعلان بازشو که به کاربر برای رسیدن به سطح تبریک می‌گوید.';
$string['potentialmoodleincompatibility'] = 'ناسازگاری بالقوه مودل';
$string['promocontactintro'] = 'برای اطلاعات بیشتر با ما تماس بگیرید. سریع جواب می‌دهیم!';
$string['promocontactus'] = 'در تماس باشید';
$string['promoemailusat'] = 'به ما ایمیل بزنید _levelup@branchup.tech_.';
$string['promoerrorsendingemail'] = 'وای! ما نتوانستیم پیام ارسال کنیم... لطفاً مستقیماً به ما ایمیل بزنید: {$a}. با تشکر!';
$string['promogetnow'] = 'اکنون XP+ را دریافت کنید!';
$string['promoifpreferemailusat'] = 'در صورت تمایل، مستقیماً به آدرس _{$a}_ به ما ایمیل بزنید.';
$string['promoyourmessagewassent'] = 'با تشکر، پیام شما ارسال شد. خیلی زود با شما تماس خواهیم گرفت.';
$string['quickeditpoints'] = 'امتیاز ویرایش سریع';
$string['reallyresetcourselevelstodefaults'] = 'آیا واقعاً سطوح دوره را به سطوح پیش فرض بازنشانی می کنید؟ این عمل برگشت پذیر نیست.';
$string['reallyresetcoursevisualstodefaults'] = 'آیا واقعاً ظاهر سطوح دوره را به ظاهر پیش فرض بازنشانی می‌کنید؟ این عمل برگشت پذیر نیست.';
$string['recommended'] = 'توصیه شده';
$string['resetlevelstodefaults'] = 'بازنشانی سطوح را به حالت پیش فرض';
$string['resetvisualstodefaults'] = 'بازنشانی ظاهر به حالت پیش فرض';
$string['rulesformhelp'] = '<p>این افزونه از رویدادها برای نسبت دادن امتیاز به اقدامات انجام شده توسط دانش آموزان استفاده می‌کند. می‌توانید از فرم زیر برای اضافه کردن قوانین خود و مشاهده قوانین پیش‌فرض استفاده کنید.</p> <p>توصیه می‌شود <a href="{$a->log}">ورود</a> افزونه را بررسی کنید. برای شناسایی رویدادهایی که هنگام انجام اقدامات در دوره راه‌اندازی می‌شوند و همچنین برای خواندن اطلاعات بیشتر درباره خود رویدادها: <a href="{$a->list}">فهرست همه رویدادها</a>، <a href= "{$a->doc}">اسناد برنامه‌نویس</a>.</p> <p>در نهایت، لطفاً توجه داشته باشید که افزونه همیشه موارد زیر را نادیده می‌گیرد: <ul> <li>عملکردهایی که توسط سرپرستان، مهمان‌ها یا غیر کاربران وارد شده اند.</li> <li>عملکردهای انجام شده توسط کاربرانی که قابلیت <em>block/xp:earnxp</em> را ندارند.</li> <li>عملکردهای تکرار شده در یک بازه زمانی کوتاه، برای جلوگیری از تقلب.</li> <li>رویدادهایی که به عنوان <em>ناشناس</em> پرچم‌گذاری می‌شوند، به عنوان مثال. در یک بازخورد ناشناس.</li> <li>و رویدادهای سطح تحصیلی با <em>شرکت</em> برابری نمی‌کند.</li> </ul> </p>';
$string['shortcode:xplevelname'] = 'نمایش نام سطح';
$string['shortcode:xppoints'] = 'نمایش تعدادی از امتیازهای فرمت شده به عنوان امتیاز تجربه.';
$string['shortcode:xppoints_help'] = 'به طور پیش فرض، این تعداد امتیاز کاربر فعلی را نشان می‌دهد. در غیر این صورت، می‌توانید عددی را برای لغو این مقدار تعیین کنید. طراحی نقاط به نمایش مقدار دلخواه یا نقاط کاربر فعلی بستگی دارد. آرگومان "plain" را می توان برای حذف هر گونه استایلی استفاده کرد. ``` [xppoints] [xppoints 500] [xppoints 123 plain] ```';
$string['shortcode:xpprogressbar'] = 'نوار پیشرفت کاربر فعلی به سمت سطح بعدی.';
$string['xpplusrequired'] = 'XP+ مورد نیاز است';
$string['xprequired'] = 'XP مورد نیاز است';
$string['youleveledupexcl'] = 'تو سطح بالا رفتی!';
